var local_grammastr = [
	{ id: "$", value: "·" },
	{ id: "$", value: "·" },
	{ id: "$", value: "·" },
	{ id: ".nt.", value: "中" },
	{ id: ".m.", value: "阳" },
	{ id: ".f.", value: "阴" },
	{ id: ".sg.", value: "单" },
	{ id: ".pl.", value: "复" },
	{ id: ".nom.", value: "主" },
	{ id: ".voc.", value: "呼" },
	{ id: ".acc.", value: "宾" },
	{ id: ".gen.", value: "属" },
	{ id: ".dat.", value: "目的" },
	{ id: ".inst.", value: "具" },
	{ id: ".abl.", value: "源" },
	{ id: ".loc.", value: "处" },
	{ id: ".imp.", value: "命令" },
	{ id: ".cond.", value: "条件" },
	{ id: ".opt.", value: "愿" },
	{ id: ".pres.", value: "现" },
	{ id: ".aor.", value: "过" },
	{ id: ".pf.", value: "完" },
	{ id: ".fut.", value: "将" },
	{ id: ".act.", value: "主" },
	{ id: ".refl.", value: "反" },
	{ id: ".1p.", value: "第一" },
	{ id: ".2p.", value: "第二" },
	{ id: ".3p.", value: "第三" },
	{ id: ".prp.", value: "现分" },
	{ id: ".prpa.", value: "现分" },
	{ id: ".prpp.", value: "现分" },
	{ id: ".pp.", value: "过分" },
	{ id: ".ppa.", value: "主过分" },
	{ id: ".ppp.", value: "被过分" },
	{ id: ".futp.", value: "未分" },
	{ id: ".fpa.", value: "未主分" },
	{ id: ".fpp.", value: "未被分" },
	{ id: ".grd.", value: "义务" },
	{ id: ".pass.", value: "被动" },
	{ id: ".caus.", value: "使役" },
	{ id: ".desid.", value: "意欲" },
	{ id: ".intens.", value: "强意" },
	{ id: ".denom.", value: "名动" },
	{ id: ".ger.", value: "连续" },
	{ id: ".abs.", value: "绝对" },
	{ id: ".inf.", value: "不定" },
	{ id: ".n.", value: "名" },
	{ id: ".n:base.", value: "名词干" },
	{ id: ".adj:base.", value: "形词干 " },
	{ id: ".pron:base.", value: "代词干" },
	{ id: ".num:base.", value: "数词干" },
	{ id: ".adj.", value: "形" },
	{ id: ".ti.", value: "三性" },
	{ id: ".num.", value: "数" },
	{ id: ".pron.", value: "代" },
	{ id: ".pron.per.", value: "人代" },
	{ id: ".pron.demon.", value: "指代" },
	{ id: ".pron.rel.", value: "关代" },
	{ id: ".pron.interr.", value: "疑代" },
	{ id: ".pron.indef.", value: "不定代" },
	{ id: ".v.", value: "动" },
	{ id: ".v:ind.", value: "动不变" },
	{ id: ".ind.", value: "不变" },
	{ id: ".adv.", value: "副" },
	{ id: ".conj.", value: "连" },
	{ id: ".prep.", value: "介" },
	{ id: ".interj.", value: "感叹" },
	{ id: ".comp.", value: "复合" },
	{ id: ".pre.", value: "前缀" },
	{ id: ".root.", value: "词根" },
	{ id: ".suf.", value: "后缀" },
	{ id: ".end.", value: "语尾" },
	{ id: ".part.", value: "待定片段" },
	{ id: "_un_auto_factormean_", value: " " },
	{ id: "_un_auto_mean_", value: "&nbsp;× × ×&nbsp;" },
	{ id: ".un.", value: "粘音" },
];

var local_type_str = [
	{ id: ".n.", value: "名" },
	{ id: ".v.", value: "动" },
	{ id: ".ti.", value: "三性" },
	{ id: ".ind.", value: "不变" },
	{ id: ".pron.", value: "代" },
	{ id: ".v:ind.", value: "动不变" },
	{ id: ".num.", value: "数" },
	{ id: ".un.", value: "粘音" },
	{ id: ".comp.", value: "复合" },
	{ id: ".pron:base.", value: "代词干" },
	{ id: ".adj:base.", value: "形词干 " },
	{ id: ".n:base.", value: "名词干" },
	{ id: ".ti:base.", value: "三性词干" },
	{ id: ".num:base.", value: "数词干" },
	{ id: ".v:base.", value: "动原型" },
	{ id: ".adj.", value: "形" },
	{ id: ".pre.", value: "前缀" },
	{ id: ".root.", value: "词根" },
	{ id: ".suf.", value: "后缀" },
	{ id: ".end.", value: "语尾" },
];

var local_formula = [
	{
		id: ".1p.$.pl.$.aor.",
		value:
			"{我们曾}~{过}${吾等曾}~{过}${我们}~{完了}${吾等}~{完了}${我们}~{了}${吾等}~{了}${我们}~{过}${吾等}~{过}${我们曾}~{}${吾等曾}~{}",
	},
	{
		id: ".1p.$.pl.$.fut.",
		value:
			"{我们将}~{}${吾等将}~{}${我们必将}~{}${吾等必将}~{}${我们一定会}~{}${吾等一定会}~{}${我们终将}~{}${吾等终将}~{}${我们定会}~{}${吾等定会}~{}${我们将要}~{}${吾等将要}~{}",
	},
	{
		id: ".1p.$.pl.$.imp.",
		value:
			"{让我们来}~{}${让吾等来}~{}${请我们}~{}${请吾等}~{}${请我们来}~{}${请吾等来}~{}${我们来}~{啊}${吾等来}~{啊}${让我们}~{}${让吾等}~{}${我们会}~{}${吾等会}~{}${我们要}~{}${吾等要}~{}${我们得}~{}${吾等得}~{}${我们去}~{啊}${吾等去}~{啊}${我们去}~{}${吾等去}~{}",
	},
	{
		id: ".1p.$.pl.$.opt.",
		value:
			"{如若我们}~{}${如若吾等}~{}${如果我们}~{}${如果吾等}~{}${若我们}~{}${若吾等}~{}${我们若}~{}${吾等若}~{}${我们如果}~{}${吾等如果}~{}${我们应}~{}${吾等应}~{}${我们愿}~{}${吾等愿}~{}${我们想}~{}${吾等想}~{}${我们愿意}~{}${吾等愿意}~{}${需要我们}~{}${需要吾等}~{}${我们需要}~{}${吾等需要}~{}${我们该}~{}${吾等该}~{}${我们应该}~{}${吾等应该}~{}",
	},
	{
		id: ".1p.$.pl.$.pres.",
		value:
			"{我们}~{}${吾等}~{}${我们在}~{呢}${吾等在}~{呢}${我们正}~{}${吾等正}~{}${我们在}~{}${吾等在}~{}${我们正在}~{}${吾等正在}~{}",
	},
	{
		id: ".1p.$.sg.$.aor.",
		value:
			"{我曾}~{过}${吾曾}~{过}${我}~{完了}${吾}~{完了}${我}~{了}${吾}~{了}${我}~{过}${吾}~{过}${我曾}~{}${吾曾}~{}",
	},
	{
		id: ".1p.$.sg.$.fut.",
		value:
			"{我将}~{}${吾将}~{}${我必将}~{}${吾必将}~{}${我一定会}~{}${吾一定会}~{}${我终将}~{}${吾终将}~{}${我定会}~{}${吾定会}~{}${我将要}~{}${吾将要}~{}",
	},
	{
		id: ".1p.$.sg.$.imp.",
		value:
			"{让我来}~{}${让吾来}~{}${请我}~{}${请吾}~{}${请我来}~{}${请吾来}~{}${我来}~{啊}${吾来}~{啊}${让我}~{}${让吾}~{}${我会}~{}${吾会}~{}${我要}~{}${吾要}~{}${我得}~{}${吾得}~{}${我去}~{啊}${吾去}~{啊}${我去}~{}${吾去}~{}",
	},
	{
		id: ".1p.$.sg.$.opt.",
		value:
			"{如若我}~{}${如若吾}~{}${如果我}~{}${如果吾}~{}${若我}~{}${若吾}~{}${我若}~{}${吾若}~{}${我如果}~{}${吾如果}~{}${我应}~{}${吾应}~{}${我愿}~{}${吾愿}~{}${我想}~{}${吾想}~{}${我愿意}~{}${吾愿意}~{}${需要我}~{}${需要吾}~{}${我需要}~{}${吾需要}~{}${我该}~{}${吾该}~{}${我应该}~{}${吾应该}~{}",
	},
	{
		id: ".1p.$.sg.$.pres.",
		value:
			"{我}~{}${吾}~{}${我在}~{呢}${吾在}~{呢}${我正}~{}${吾正}~{}${我在}~{}${吾在}~{}${我正在}~{}${吾正在}~{}",
	},
	{
		id: ".2p.$.pl.$.aor.",
		value:
			"{你们曾}~{过}${您曾}~{过}${大家曾}~{过}${汝等曾}~{过}${你们}~{完了}${您}~{完了}${大家}~{完了}${汝等}~{完了}${你们}~{了}${您}~{了}${大家}~{了}${汝等}~{了}${你们}~{过}${您}~{过}${大家}~{过}${汝等}~{过}${你们曾}~{}${您曾}~{}${大家曾}~{}${汝等曾}~{}",
	},
	{
		id: ".2p.$.pl.$.fut.",
		value:
			"{你们将}~{}${您将}~{}${大家将}~{}${汝等将}~{}${你们必将}~{}${您必将}~{}${大家必将}~{}${汝等必将}~{}${你们一定会}~{}${您一定会}~{}${大家一定会}~{}${汝等一定会}~{}${你们终将}~{}${您终将}~{}${大家终将}~{}${汝等终将}~{}${你们定会}~{}${您定会}~{}${大家定会}~{}${汝等定会}~{}${你们将要}~{}${您将要}~{}${大家将要}~{}${汝等将要}~{}",
	},
	{
		id: ".2p.$.pl.$.imp.",
		value:
			"{让你们来}~{}${让您来}~{}${让大家来}~{}${让汝等来}~{}${请你们}~{}${请您}~{}${请大家}~{}${请汝等}~{}${请你们来}~{}${请您来}~{}${请大家来}~{}${请汝等来}~{}${你们来}~{啊}${您来}~{啊}${大家来}~{啊}${汝等来}~{啊}${让你们}~{}${让您}~{}${让大家}~{}${让汝等}~{}${你们会}~{}${您会}~{}${大家会}~{}${汝等会}~{}${你们要}~{}${您要}~{}${大家要}~{}${汝等要}~{}${你们得}~{}${您得}~{}${大家得}~{}${汝等得}~{}${你们去}~{啊}${您去}~{啊}${大家去}~{啊}${汝等去}~{啊}${你们去}~{}${您去}~{}${大家去}~{}${汝等去}~{}",
	},
	{
		id: ".2p.$.pl.$.opt.",
		value:
			"{如若你们}~{}${如若您}~{}${如若大家}~{}${如若汝等}~{}${如果你们}~{}${如果您}~{}${如果大家}~{}${如果汝等}~{}${若你们}~{}${若您}~{}${若大家}~{}${若汝等}~{}${你们若}~{}${您若}~{}${大家若}~{}${汝等若}~{}${你们如果}~{}${您如果}~{}${大家如果}~{}${汝等如果}~{}${你们应}~{}${您应}~{}${大家应}~{}${汝等应}~{}${你们愿}~{}${您愿}~{}${大家愿}~{}${汝等愿}~{}${你们想}~{}${您想}~{}${大家想}~{}${汝等想}~{}${你们愿意}~{}${您愿意}~{}${大家愿意}~{}${汝等愿意}~{}${需要你们}~{}${需要您}~{}${需要大家}~{}${需要汝等}~{}${你们需要}~{}${您需要}~{}${大家需要}~{}${汝等需要}~{}${你们该}~{}${您该}~{}${大家该}~{}${汝等该}~{}${你们应该}~{}${您应该}~{}${大家应该}~{}${汝等应该}~{}",
	},
	{
		id: ".2p.$.pl.$.pres.",
		value:
			"{你们}~{}${您}~{}${大家}~{}${汝等}~{}${你们在}~{呢}${您在}~{呢}${大家在}~{呢}${汝等在}~{呢}${你们正}~{}${您正}~{}${大家正}~{}${汝等正}~{}${你们在}~{}${您在}~{}${大家在}~{}${汝等在}~{}${你们正在}~{}${您正在}~{}${大家正在}~{}${汝等正在}~{}",
	},
	{
		id: ".2p.$.sg.$.aor.",
		value:
			"{你曾}~{过}${汝曾}~{过}${你}~{完了}${汝}~{完了}${你}~{了}${汝}~{了}${你}~{过}${汝}~{过}${你曾}~{}${汝曾}~{}",
	},
	{
		id: ".2p.$.sg.$.fut.",
		value:
			"{你将}~{}${汝将}~{}${你必将}~{}${汝必将}~{}${你一定会}~{}${汝一定会}~{}${你终将}~{}${汝终将}~{}${你定会}~{}${汝定会}~{}${你将要}~{}${汝将要}~{}",
	},
	{
		id: ".2p.$.sg.$.imp.",
		value:
			"{让你来}~{}${让汝来}~{}${请你}~{}${请汝}~{}${请你来}~{}${请汝来}~{}${你来}~{啊}${汝来}~{啊}${让你}~{}${让汝}~{}${你会}~{}${汝会}~{}${你要}~{}${汝要}~{}${你得}~{}${汝得}~{}${你去}~{啊}${汝去}~{啊}${你去}~{}${汝去}~{}",
	},
	{
		id: ".2p.$.sg.$.opt.",
		value:
			"{如若你}~{}${如若汝}~{}${如果你}~{}${如果汝}~{}${若你}~{}${若汝}~{}${你若}~{}${汝若}~{}${你如果}~{}${汝如果}~{}${你应}~{}${汝应}~{}${你愿}~{}${汝愿}~{}${你想}~{}${汝想}~{}${你愿意}~{}${汝愿意}~{}${需要你}~{}${需要汝}~{}${你需要}~{}${汝需要}~{}${你该}~{}${汝该}~{}${你应该}~{}${汝应该}~{}",
	},
	{
		id: ".2p.$.sg.$.pres.",
		value:
			"{你}~{}${汝}~{}${你在}~{呢}${汝在}~{呢}${你正}~{}${汝正}~{}${你在}~{}${汝在}~{}${你正在}~{}${汝正在}~{}",
	},
	{
		id: ".3p.$.pl.$.aor.",
		value:
			"{其等曾}~{过}${TA们曾}~{过}${他们曾}~{过}${她们曾}~{过}${它们曾}~{过}${其等}~{完了}${TA们}~{完了}${他们}~{完了}${她们}~{完了}${它们}~{完了}${其等}~{了}${TA们}~{了}${他们}~{了}${她们}~{了}${它们}~{了}${其等}~{过}${TA们}~{过}${他们}~{过}${她们}~{过}${它们}~{过}${其等曾}~{}${TA们曾}~{}${他们曾}~{}${她们曾}~{}${它们曾}~{}",
	},
	{
		id: ".3p.$.pl.$.fut.",
		value:
			"{其等将}~{}${TA们将}~{}${他们将}~{}${她们将}~{}${它们将}~{}${其等必将}~{}${TA们必将}~{}${他们必将}~{}${她们必将}~{}${它们必将}~{}${其等一定会}~{}${TA们一定会}~{}${他们一定会}~{}${她们一定会}~{}${它们一定会}~{}${其等终将}~{}${TA们终将}~{}${他们终将}~{}${她们终将}~{}${它们终将}~{}${其等定会}~{}${TA们定会}~{}${他们定会}~{}${她们定会}~{}${它们定会}~{}${其等将要}~{}${TA们将要}~{}${他们将要}~{}${她们将要}~{}${它们将要}~{}",
	},
	{
		id: ".3p.$.pl.$.imp.",
		value:
			"{让其等来}~{}${让TA们来}~{}${让他们来}~{}${让她们来}~{}${让它们来}~{}${请其等}~{}${请TA们}~{}${请他们}~{}${请她们}~{}${请它们}~{}${请其等来}~{}${请TA们来}~{}${请他们来}~{}${请她们来}~{}${请它们来}~{}${其等来}~{啊}${TA们来}~{啊}${他们来}~{啊}${她们来}~{啊}${它们来}~{啊}${让其等}~{}${让TA们}~{}${让他们}~{}${让她们}~{}${让它们}~{}${其等会}~{}${TA们会}~{}${他们会}~{}${她们会}~{}${它们会}~{}${其等要}~{}${TA们要}~{}${他们要}~{}${她们要}~{}${它们要}~{}${其等得}~{}${TA们得}~{}${他们得}~{}${她们得}~{}${它们得}~{}${其等去}~{啊}${TA们去}~{啊}${他们去}~{啊}${她们去}~{啊}${它们去}~{啊}${其等去}~{}${TA们去}~{}${他们去}~{}${她们去}~{}${它们去}~{}",
	},
	{
		id: ".3p.$.pl.$.opt.",
		value:
			"{如若其等}~{}${如若TA们}~{}${如若他们}~{}${如若她们}~{}${如若它们}~{}${如果其等}~{}${如果TA们}~{}${如果他们}~{}${如果她们}~{}${如果它们}~{}${若其等}~{}${若TA们}~{}${若他们}~{}${若她们}~{}${若它们}~{}${其等若}~{}${TA们若}~{}${他们若}~{}${她们若}~{}${它们若}~{}${其等如果}~{}${TA们如果}~{}${他们如果}~{}${她们如果}~{}${它们如果}~{}${其等应}~{}${TA们应}~{}${他们应}~{}${她们应}~{}${它们应}~{}${其等愿}~{}${TA们愿}~{}${他们愿}~{}${她们愿}~{}${它们愿}~{}${其等想}~{}${TA们想}~{}${他们想}~{}${她们想}~{}${它们想}~{}${其等愿意}~{}${TA们愿意}~{}${他们愿意}~{}${她们愿意}~{}${它们愿意}~{}${需要其等}~{}${需要TA们}~{}${需要他们}~{}${需要她们}~{}${需要它们}~{}${其等需要}~{}${TA们需要}~{}${他们需要}~{}${她们需要}~{}${它们需要}~{}${其等该}~{}${TA们该}~{}${他们该}~{}${她们该}~{}${它们该}~{}${其等应该}~{}${TA们应该}~{}${他们应该}~{}${她们应该}~{}${它们应该}~{}",
	},
	{
		id: ".3p.$.pl.$.pres.",
		value:
			"{其等}~{}${TA们}~{}${他们}~{}${她们}~{}${它们}~{}${其等在}~{呢}${TA们在}~{呢}${他们在}~{呢}${她们在}~{呢}${它们在}~{呢}${其等正}~{}${TA们正}~{}${他们正}~{}${她们正}~{}${它们正}~{}${其等在}~{}${TA们在}~{}${他们在}~{}${她们在}~{}${它们在}~{}${其等正在}~{}${TA们正在}~{}${他们正在}~{}${她们正在}~{}${它们正在}~{}",
	},
	{
		id: ".3p.$.sg.$.aor.",
		value:
			"{其曾}~{过}${他曾}~{过}${她曾}~{过}${它曾}~{过}${其}~{完了}${他}~{完了}${她}~{完了}${它}~{完了}${其}~{了}${他}~{了}${她}~{了}${它}~{了}${其}~{过}${他}~{过}${她}~{过}${它}~{过}${其曾}~{}${他曾}~{}${她曾}~{}${它曾}~{}",
	},
	{
		id: ".3p.$.sg.$.fut.",
		value:
			"{其将}~{}${他将}~{}${她将}~{}${它将}~{}${其必将}~{}${他必将}~{}${她必将}~{}${它必将}~{}${其一定会}~{}${他一定会}~{}${她一定会}~{}${它一定会}~{}${其终将}~{}${他终将}~{}${她终将}~{}${它终将}~{}${其定会}~{}${他定会}~{}${她定会}~{}${它定会}~{}${其将要}~{}${他将要}~{}${她将要}~{}${它将要}~{}",
	},
	{
		id: ".3p.$.sg.$.imp.",
		value:
			"{让其来}~{}${让他来}~{}${让她来}~{}${让它来}~{}${请其}~{}${请他}~{}${请她}~{}${请它}~{}${请其来}~{}${请他来}~{}${请她来}~{}${请它来}~{}${其来}~{啊}${他来}~{啊}${她来}~{啊}${它来}~{啊}${让其}~{}${让他}~{}${让她}~{}${让它}~{}${其会}~{}${他会}~{}${她会}~{}${它会}~{}${其要}~{}${他要}~{}${她要}~{}${它要}~{}${其得}~{}${他得}~{}${她得}~{}${它得}~{}${其去}~{啊}${他去}~{啊}${她去}~{啊}${它去}~{啊}${其去}~{}${他去}~{}${她去}~{}${它去}~{}",
	},
	{
		id: ".3p.$.sg.$.opt.",
		value:
			"{如若其}~{}${如若他}~{}${如若她}~{}${如若它}~{}${如果其}~{}${如果他}~{}${如果她}~{}${如果它}~{}${若其}~{}${若他}~{}${若她}~{}${若它}~{}${其若}~{}${他若}~{}${她若}~{}${它若}~{}${其如果}~{}${他如果}~{}${她如果}~{}${它如果}~{}${其应}~{}${他应}~{}${她应}~{}${它应}~{}${其愿}~{}${他愿}~{}${她愿}~{}${它愿}~{}${其想}~{}${他想}~{}${她想}~{}${它想}~{}${其愿意}~{}${他愿意}~{}${她愿意}~{}${它愿意}~{}${需要其}~{}${需要他}~{}${需要她}~{}${需要它}~{}${其需要}~{}${他需要}~{}${她需要}~{}${它需要}~{}${其该}~{}${他该}~{}${她该}~{}${它该}~{}${其应该}~{}${他应该}~{}${她应该}~{}${它应该}~{}",
	},
	{
		id: ".3p.$.sg.$.pres.",
		value:
			"{其}~{}${他}~{}${她}~{}${它}~{}${其在}~{呢}${他在}~{呢}${她在}~{呢}${它在}~{呢}${其正}~{}${他正}~{}${她正}~{}${它正}~{}${其在}~{}${他在}~{}${她在}~{}${它在}~{}${其正在}~{}${他正在}~{}${她正在}~{}${它正在}~{}",
	},

	{
		id: ".pl.$.abl.",
		value:
			"{由诸}~${由}~{等}${由}~{们}${由}~{些}${出于诸}~${出于}~{等}${出于}~{们}${出于}~{些}${从诸}~{而来}${从}~{等而来}${从}~{们而来}${从}~{些而来}${从诸}~${从}~{等}${从}~{们}${从}~{些}${来自诸}~${来自}~{等}${来自}~{们}${来自}~{些}${比诸}~${比}~{等}${比}~{们}${比}~{些}${由于诸}~${由于}~{等}${由于}~{们}${由于}~{些}${因为诸}~${因为}~{等}${因为}~{们}${因为}~{些}",
	},
	{
		id: "$.pl.$.abl.",
		value:
			"{由诸}~${由}~{等}${由}~{们}${由}~{些}${出于诸}~${出于}~{等}${出于}~{们}${出于}~{些}${从诸}~{而来}${从}~{等而来}${从}~{们而来}${从}~{些而来}${从诸}~${从}~{等}${从}~{们}${从}~{些}${来自诸}~${来自}~{等}${来自}~{们}${来自}~{些}${比诸}~${比}~{等}${比}~{们}${比}~{些}${由于诸}~${由于}~{等}${由于}~{们}${由于}~{些}${因为诸}~${因为}~{等}${因为}~{们}${因为}~{些}",
	},
	{
		id: ".1p.$.pl.$.abl.",
		value:
			"{由诸}~${由}~{等}${由}~{们}${由}~{些}${出于诸}~${出于}~{等}${出于}~{们}${出于}~{些}${从诸}~{而来}${从}~{等而来}${从}~{们而来}${从}~{些而来}${从诸}~${从}~{等}${从}~{们}${从}~{些}${来自诸}~${来自}~{等}${来自}~{们}${来自}~{些}${比诸}~${比}~{等}${比}~{们}${比}~{些}${由于诸}~${由于}~{等}${由于}~{们}${由于}~{些}${因为诸}~${因为}~{等}${因为}~{们}${因为}~{些}",
	},
	{
		id: ".2p.$.pl.$.abl.",
		value:
			"{由诸}~${由}~{等}${由}~{们}${由}~{些}${出于诸}~${出于}~{等}${出于}~{们}${出于}~{些}${从诸}~{而来}${从}~{等而来}${从}~{们而来}${从}~{些而来}${从诸}~${从}~{等}${从}~{们}${从}~{些}${来自诸}~${来自}~{等}${来自}~{们}${来自}~{些}${比诸}~${比}~{等}${比}~{们}${比}~{些}${由于诸}~${由于}~{等}${由于}~{们}${由于}~{些}${因为诸}~${因为}~{等}${因为}~{们}${因为}~{些}",
	},
	{
		id: ".m.$.pl.$.abl.",
		value:
			"{由诸}~${由}~{等}${由}~{们}${由}~{些}${出于诸}~${出于}~{等}${出于}~{们}${出于}~{些}${从诸}~{而来}${从}~{等而来}${从}~{们而来}${从}~{些而来}${从诸}~${从}~{等}${从}~{们}${从}~{些}${来自诸}~${来自}~{等}${来自}~{们}${来自}~{些}${比诸}~${比}~{等}${比}~{们}${比}~{些}${由于诸}~${由于}~{等}${由于}~{们}${由于}~{些}${因为诸}~${因为}~{等}${因为}~{们}${因为}~{些}",
	},
	{
		id: ".nt.$.pl.$.abl.",
		value:
			"{由诸}~${由}~{等}${由}~{们}${由}~{些}${出于诸}~${出于}~{等}${出于}~{们}${出于}~{些}${从诸}~{而来}${从}~{等而来}${从}~{们而来}${从}~{些而来}${从诸}~${从}~{等}${从}~{们}${从}~{些}${来自诸}~${来自}~{等}${来自}~{们}${来自}~{些}${比诸}~${比}~{等}${比}~{们}${比}~{些}${由于诸}~${由于}~{等}${由于}~{们}${由于}~{些}${因为诸}~${因为}~{等}${因为}~{们}${因为}~{些}",
	},
	{
		id: ".f.$.pl.$.abl.",
		value:
			"{由诸}~${由}~{等}${由}~{们}${由}~{些}${出于诸}~${出于}~{等}${出于}~{们}${出于}~{些}${从诸}~{而来}${从}~{等而来}${从}~{们而来}${从}~{些而来}${从诸}~${从}~{等}${从}~{们}${从}~{些}${来自诸}~${来自}~{等}${来自}~{们}${来自}~{些}${比诸}~${比}~{等}${比}~{们}${比}~{些}${由于诸}~${由于}~{等}${由于}~{们}${由于}~{些}${因为诸}~${因为}~{等}${因为}~{们}${因为}~{些}",
	},
	{ id: ".pl.$.acc.", value: "{把诸}~${把}~{等}${把}~{们}${把}~{些}${诸}~$~{等}$~{们}$~{些}" },
	{ id: "$.pl.$.acc.", value: "{把诸}~${把}~{等}${把}~{们}${把}~{些}${诸}~$~{等}$~{们}$~{些}" },
	{ id: ".1p.$.pl.$.acc.", value: "{把诸}~${把}~{等}${把}~{们}${把}~{些}${诸}~$~{等}$~{们}$~{些}" },
	{ id: ".2p.$.pl.$.acc.", value: "{把诸}~${把}~{等}${把}~{们}${把}~{些}${诸}~$~{等}$~{们}$~{些}" },
	{ id: ".m.$.pl.$.acc.", value: "{把诸}~${把}~{等}${把}~{们}${把}~{些}${诸}~$~{等}$~{们}$~{些}" },
	{ id: ".nt.$.pl.$.acc.", value: "{把诸}~${把}~{等}${把}~{们}${把}~{些}${诸}~$~{等}$~{们}$~{些}" },
	{ id: ".f.$.pl.$.acc.", value: "{把诸}~${把}~{等}${把}~{们}${把}~{些}${诸}~$~{等}$~{们}$~{些}" },
	{
		id: ".pl.$.dat.",
		value:
			"{对于诸}~${对于}~{等}${对于}~{们}${对于}~{些}${对诸}~{来说}${对}~{等来说}${对}~{们来说}${对}~{些来说}${为了诸}~${为了}~{等}${为了}~{们}${为了}~{些}${向诸}~${向}~{等}${向}~{们}${向}~{些}${对诸}~${对}~{等}${对}~{们}${对}~{些}",
	},
	{
		id: "$.pl.$.dat.",
		value:
			"{对于诸}~${对于}~{等}${对于}~{们}${对于}~{些}${对诸}~{来说}${对}~{等来说}${对}~{们来说}${对}~{些来说}${为了诸}~${为了}~{等}${为了}~{们}${为了}~{些}${向诸}~${向}~{等}${向}~{们}${向}~{些}${对诸}~${对}~{等}${对}~{们}${对}~{些}",
	},
	{
		id: ".1p.$.pl.$.dat.",
		value:
			"{对于诸}~${对于}~{等}${对于}~{们}${对于}~{些}${对诸}~{来说}${对}~{等来说}${对}~{们来说}${对}~{些来说}${为了诸}~${为了}~{等}${为了}~{们}${为了}~{些}${向诸}~${向}~{等}${向}~{们}${向}~{些}${对诸}~${对}~{等}${对}~{们}${对}~{些}",
	},
	{
		id: ".2p.$.pl.$.dat.",
		value:
			"{对于诸}~${对于}~{等}${对于}~{们}${对于}~{些}${对诸}~{来说}${对}~{等来说}${对}~{们来说}${对}~{些来说}${为了诸}~${为了}~{等}${为了}~{们}${为了}~{些}${向诸}~${向}~{等}${向}~{们}${向}~{些}${对诸}~${对}~{等}${对}~{们}${对}~{些}",
	},
	{
		id: ".m.$.pl.$.dat.",
		value:
			"{对于诸}~${对于}~{等}${对于}~{们}${对于}~{些}${对诸}~{来说}${对}~{等来说}${对}~{们来说}${对}~{些来说}${为了诸}~${为了}~{等}${为了}~{们}${为了}~{些}${向诸}~${向}~{等}${向}~{们}${向}~{些}${对诸}~${对}~{等}${对}~{们}${对}~{些}",
	},
	{
		id: ".nt.$.pl.$.dat.",
		value:
			"{对于诸}~${对于}~{等}${对于}~{们}${对于}~{些}${对诸}~{来说}${对}~{等来说}${对}~{们来说}${对}~{些来说}${为了诸}~${为了}~{等}${为了}~{们}${为了}~{些}${向诸}~${向}~{等}${向}~{们}${向}~{些}${对诸}~${对}~{等}${对}~{们}${对}~{些}",
	},
	{
		id: ".f.$.pl.$.dat.",
		value:
			"{对于诸}~${对于}~{等}${对于}~{们}${对于}~{些}${对诸}~{来说}${对}~{等来说}${对}~{们来说}${对}~{些来说}${为了诸}~${为了}~{等}${为了}~{们}${为了}~{些}${向诸}~${向}~{等}${向}~{们}${向}~{些}${对诸}~${对}~{等}${对}~{们}${对}~{些}",
	},
	{ id: ".pl.$.gen.", value: "{诸}~{的}$~{等的}$~{们的}$~{些的}${诸}~{之}$~{等之}$~{们之}$~{些之}" },
	{ id: "$.pl.$.gen.", value: "{诸}~{的}$~{等的}$~{们的}$~{些的}${诸}~{之}$~{等之}$~{们之}$~{些之}" },
	{ id: ".1p.$.pl.$.gen.", value: "{诸}~{的}$~{等的}$~{们的}$~{些的}${诸}~{之}$~{等之}$~{们之}$~{些之}" },
	{ id: ".2p.$.pl.$.gen.", value: "{诸}~{的}$~{等的}$~{们的}$~{些的}${诸}~{之}$~{等之}$~{们之}$~{些之}" },
	{ id: ".m.$.pl.$.gen.", value: "{诸}~{的}$~{等的}$~{们的}$~{些的}${诸}~{之}$~{等之}$~{们之}$~{些之}" },
	{ id: ".nt.$.pl.$.gen.", value: "{诸}~{的}$~{等的}$~{们的}$~{些的}${诸}~{之}$~{等之}$~{们之}$~{些之}" },
	{ id: ".f.$.pl.$.gen.", value: "{诸}~{的}$~{等的}$~{们的}$~{些的}${诸}~{之}$~{等之}$~{们之}$~{些之}" },
	{
		id: ".pl.$.inst.",
		value:
			"{以诸}~${以}~{等}${以}~{们}${以}~{些}${通过诸}~${通过}~{等}${通过}~{们}${通过}~{些}${被诸}~${被}~{等}${被}~{们}${被}~{些}${根据诸}~${根据}~{等}${根据}~{们}${根据}~{些}${跟诸}~${跟}~{等}${跟}~{们}${跟}~{些}${经过诸}~${经过}~{等}${经过}~{们}${经过}~{些}${经由诸}~${经由}~{等}${经由}~{们}${经由}~{些}${由经诸}~${由经}~{等}${由经}~{们}${由经}~{些}",
	},
	{
		id: "$.pl.$.inst.",
		value:
			"{以诸}~${以}~{等}${以}~{们}${以}~{些}${通过诸}~${通过}~{等}${通过}~{们}${通过}~{些}${被诸}~${被}~{等}${被}~{们}${被}~{些}${根据诸}~${根据}~{等}${根据}~{们}${根据}~{些}${跟诸}~${跟}~{等}${跟}~{们}${跟}~{些}${经过诸}~${经过}~{等}${经过}~{们}${经过}~{些}${经由诸}~${经由}~{等}${经由}~{们}${经由}~{些}${由经诸}~${由经}~{等}${由经}~{们}${由经}~{些}",
	},
	{
		id: ".1p.$.pl.$.inst.",
		value:
			"{以诸}~${以}~{等}${以}~{们}${以}~{些}${通过诸}~${通过}~{等}${通过}~{们}${通过}~{些}${被诸}~${被}~{等}${被}~{们}${被}~{些}${根据诸}~${根据}~{等}${根据}~{们}${根据}~{些}${跟诸}~${跟}~{等}${跟}~{们}${跟}~{些}${经过诸}~${经过}~{等}${经过}~{们}${经过}~{些}${经由诸}~${经由}~{等}${经由}~{们}${经由}~{些}${由经诸}~${由经}~{等}${由经}~{们}${由经}~{些}",
	},
	{
		id: ".2p.$.pl.$.inst.",
		value:
			"{以诸}~${以}~{等}${以}~{们}${以}~{些}${通过诸}~${通过}~{等}${通过}~{们}${通过}~{些}${被诸}~${被}~{等}${被}~{们}${被}~{些}${根据诸}~${根据}~{等}${根据}~{们}${根据}~{些}${跟诸}~${跟}~{等}${跟}~{们}${跟}~{些}${经过诸}~${经过}~{等}${经过}~{们}${经过}~{些}${经由诸}~${经由}~{等}${经由}~{们}${经由}~{些}${由经诸}~${由经}~{等}${由经}~{们}${由经}~{些}",
	},
	{
		id: ".m.$.pl.$.inst.",
		value:
			"{以诸}~${以}~{等}${以}~{们}${以}~{些}${通过诸}~${通过}~{等}${通过}~{们}${通过}~{些}${被诸}~${被}~{等}${被}~{们}${被}~{些}${根据诸}~${根据}~{等}${根据}~{们}${根据}~{些}${跟诸}~${跟}~{等}${跟}~{们}${跟}~{些}${经过诸}~${经过}~{等}${经过}~{们}${经过}~{些}${经由诸}~${经由}~{等}${经由}~{们}${经由}~{些}${由经诸}~${由经}~{等}${由经}~{们}${由经}~{些}",
	},
	{
		id: ".nt.$.pl.$.inst.",
		value:
			"{以诸}~${以}~{等}${以}~{们}${以}~{些}${通过诸}~${通过}~{等}${通过}~{们}${通过}~{些}${被诸}~${被}~{等}${被}~{们}${被}~{些}${根据诸}~${根据}~{等}${根据}~{们}${根据}~{些}${跟诸}~${跟}~{等}${跟}~{们}${跟}~{些}${经过诸}~${经过}~{等}${经过}~{们}${经过}~{些}${经由诸}~${经由}~{等}${经由}~{们}${经由}~{些}${由经诸}~${由经}~{等}${由经}~{们}${由经}~{些}",
	},
	{
		id: ".f.$.pl.$.inst.",
		value:
			"{以诸}~${以}~{等}${以}~{们}${以}~{些}${通过诸}~${通过}~{等}${通过}~{们}${通过}~{些}${被诸}~${被}~{等}${被}~{们}${被}~{些}${根据诸}~${根据}~{等}${根据}~{们}${根据}~{些}${跟诸}~${跟}~{等}${跟}~{们}${跟}~{些}${经过诸}~${经过}~{等}${经过}~{们}${经过}~{些}${经由诸}~${经由}~{等}${经由}~{们}${经由}~{些}${由经诸}~${由经}~{等}${由经}~{们}${由经}~{些}",
	},
	{
		id: ".pl.$.loc.",
		value:
			"{在诸}~${在}~{等}${在}~{们}${在}~{些}${在诸}~{上}${在}~{等上}${在}~{们上}${在}~{些上}${在诸}~{里}${在}~{等里}${在}~{们里}${在}~{些里}${在诸}~{旁}${在}~{等旁}${在}~{们旁}${在}~{些旁}${于诸}~{处}${于}~{等处}${于}~{们处}${于}~{些处}${在诸}~{状态}${在}~{等状态}${在}~{们状态}${在}~{些状态}${处于诸}~{状态}${处于}~{等状态}${处于}~{们状态}${处于}~{些状态}${于诸}~{情形下}${于}~{等情形下}${于}~{们情形下}${于}~{些情形下}${处于诸}~${处于}~{等}${处于}~{们}${处于}~{些}${于诸}~${于}~{等}${于}~{们}${于}~{些}${诸}~{处}$~{等处}$~{们处}$~{些处}${诸}~{时}$~{等时}$~{们时}$~{些时}${诸}~{状态}$~{等状态}$~{们状态}$~{些状态}${在诸}~{情形下}${在}~{等情形下}${在}~{们情形下}${在}~{些情形下}${处于诸}~{情形下}${处于}~{等情形下}${处于}~{们情形下}${处于}~{些情形下}${诸}~{情形下}$~{等情形下}$~{们情形下}$~{些情形下}${在诸}~{处}${在}~{等处}${在}~{们处}${在}~{些处}${在诸}~${在}~{等}${在}~{们}${在}~{些}${在诸}~{处}${在}~{等处}${在}~{们处}${在}~{些处}${在诸}~{时}${在}~{等时}${在}~{们时}${在}~{些时}${于诸}~{状态}${于}~{等状态}${于}~{们状态}${于}~{些状态}${于诸}~{时}${于}~{等时}${于}~{们时}${于}~{些时}${于诸}~{状态}${于}~{等状态}${于}~{们状态}${于}~{些状态}",
	},
	{
		id: "$.pl.$.loc.",
		value:
			"{在诸}~${在}~{等}${在}~{们}${在}~{些}${在诸}~{上}${在}~{等上}${在}~{们上}${在}~{些上}${在诸}~{里}${在}~{等里}${在}~{们里}${在}~{些里}${在诸}~{旁}${在}~{等旁}${在}~{们旁}${在}~{些旁}${于诸}~{处}${于}~{等处}${于}~{们处}${于}~{些处}${在诸}~{状态}${在}~{等状态}${在}~{们状态}${在}~{些状态}${处于诸}~{状态}${处于}~{等状态}${处于}~{们状态}${处于}~{些状态}${于诸}~{情形下}${于}~{等情形下}${于}~{们情形下}${于}~{些情形下}${处于诸}~${处于}~{等}${处于}~{们}${处于}~{些}${于诸}~${于}~{等}${于}~{们}${于}~{些}${诸}~{处}$~{等处}$~{们处}$~{些处}${诸}~{时}$~{等时}$~{们时}$~{些时}${诸}~{状态}$~{等状态}$~{们状态}$~{些状态}${在诸}~{情形下}${在}~{等情形下}${在}~{们情形下}${在}~{些情形下}${处于诸}~{情形下}${处于}~{等情形下}${处于}~{们情形下}${处于}~{些情形下}${诸}~{情形下}$~{等情形下}$~{们情形下}$~{些情形下}${在诸}~{处}${在}~{等处}${在}~{们处}${在}~{些处}${在诸}~${在}~{等}${在}~{们}${在}~{些}${在诸}~{处}${在}~{等处}${在}~{们处}${在}~{些处}${在诸}~{时}${在}~{等时}${在}~{们时}${在}~{些时}${于诸}~{状态}${于}~{等状态}${于}~{们状态}${于}~{些状态}${于诸}~{时}${于}~{等时}${于}~{们时}${于}~{些时}${于诸}~{状态}${于}~{等状态}${于}~{们状态}${于}~{些状态}",
	},
	{
		id: ".1p.$.pl.$.loc.",
		value:
			"{在诸}~${在}~{等}${在}~{们}${在}~{些}${在诸}~{上}${在}~{等上}${在}~{们上}${在}~{些上}${在诸}~{里}${在}~{等里}${在}~{们里}${在}~{些里}${在诸}~{旁}${在}~{等旁}${在}~{们旁}${在}~{些旁}${于诸}~{处}${于}~{等处}${于}~{们处}${于}~{些处}${在诸}~{状态}${在}~{等状态}${在}~{们状态}${在}~{些状态}${处于诸}~{状态}${处于}~{等状态}${处于}~{们状态}${处于}~{些状态}${于诸}~{情形下}${于}~{等情形下}${于}~{们情形下}${于}~{些情形下}${处于诸}~${处于}~{等}${处于}~{们}${处于}~{些}${于诸}~${于}~{等}${于}~{们}${于}~{些}${诸}~{处}$~{等处}$~{们处}$~{些处}${诸}~{时}$~{等时}$~{们时}$~{些时}${诸}~{状态}$~{等状态}$~{们状态}$~{些状态}${在诸}~{情形下}${在}~{等情形下}${在}~{们情形下}${在}~{些情形下}${处于诸}~{情形下}${处于}~{等情形下}${处于}~{们情形下}${处于}~{些情形下}${诸}~{情形下}$~{等情形下}$~{们情形下}$~{些情形下}${在诸}~{处}${在}~{等处}${在}~{们处}${在}~{些处}${在诸}~${在}~{等}${在}~{们}${在}~{些}${在诸}~{处}${在}~{等处}${在}~{们处}${在}~{些处}${在诸}~{时}${在}~{等时}${在}~{们时}${在}~{些时}${于诸}~{状态}${于}~{等状态}${于}~{们状态}${于}~{些状态}${于诸}~{时}${于}~{等时}${于}~{们时}${于}~{些时}${于诸}~{状态}${于}~{等状态}${于}~{们状态}${于}~{些状态}",
	},
	{
		id: ".2p.$.pl.$.loc.",
		value:
			"{在诸}~${在}~{等}${在}~{们}${在}~{些}${在诸}~{上}${在}~{等上}${在}~{们上}${在}~{些上}${在诸}~{里}${在}~{等里}${在}~{们里}${在}~{些里}${在诸}~{旁}${在}~{等旁}${在}~{们旁}${在}~{些旁}${于诸}~{处}${于}~{等处}${于}~{们处}${于}~{些处}${在诸}~{状态}${在}~{等状态}${在}~{们状态}${在}~{些状态}${处于诸}~{状态}${处于}~{等状态}${处于}~{们状态}${处于}~{些状态}${于诸}~{情形下}${于}~{等情形下}${于}~{们情形下}${于}~{些情形下}${处于诸}~${处于}~{等}${处于}~{们}${处于}~{些}${于诸}~${于}~{等}${于}~{们}${于}~{些}${诸}~{处}$~{等处}$~{们处}$~{些处}${诸}~{时}$~{等时}$~{们时}$~{些时}${诸}~{状态}$~{等状态}$~{们状态}$~{些状态}${在诸}~{情形下}${在}~{等情形下}${在}~{们情形下}${在}~{些情形下}${处于诸}~{情形下}${处于}~{等情形下}${处于}~{们情形下}${处于}~{些情形下}${诸}~{情形下}$~{等情形下}$~{们情形下}$~{些情形下}${在诸}~{处}${在}~{等处}${在}~{们处}${在}~{些处}${在诸}~${在}~{等}${在}~{们}${在}~{些}${在诸}~{处}${在}~{等处}${在}~{们处}${在}~{些处}${在诸}~{时}${在}~{等时}${在}~{们时}${在}~{些时}${于诸}~{状态}${于}~{等状态}${于}~{们状态}${于}~{些状态}${于诸}~{时}${于}~{等时}${于}~{们时}${于}~{些时}${于诸}~{状态}${于}~{等状态}${于}~{们状态}${于}~{些状态}",
	},
	{
		id: ".m.$.pl.$.loc.",
		value:
			"{在诸}~${在}~{等}${在}~{们}${在}~{些}${在诸}~{上}${在}~{等上}${在}~{们上}${在}~{些上}${在诸}~{里}${在}~{等里}${在}~{们里}${在}~{些里}${在诸}~{旁}${在}~{等旁}${在}~{们旁}${在}~{些旁}${于诸}~{处}${于}~{等处}${于}~{们处}${于}~{些处}${在诸}~{状态}${在}~{等状态}${在}~{们状态}${在}~{些状态}${处于诸}~{状态}${处于}~{等状态}${处于}~{们状态}${处于}~{些状态}${于诸}~{情形下}${于}~{等情形下}${于}~{们情形下}${于}~{些情形下}${处于诸}~${处于}~{等}${处于}~{们}${处于}~{些}${于诸}~${于}~{等}${于}~{们}${于}~{些}${诸}~{处}$~{等处}$~{们处}$~{些处}${诸}~{时}$~{等时}$~{们时}$~{些时}${诸}~{状态}$~{等状态}$~{们状态}$~{些状态}${在诸}~{情形下}${在}~{等情形下}${在}~{们情形下}${在}~{些情形下}${处于诸}~{情形下}${处于}~{等情形下}${处于}~{们情形下}${处于}~{些情形下}${诸}~{情形下}$~{等情形下}$~{们情形下}$~{些情形下}${在诸}~{处}${在}~{等处}${在}~{们处}${在}~{些处}${在诸}~${在}~{等}${在}~{们}${在}~{些}${在诸}~{处}${在}~{等处}${在}~{们处}${在}~{些处}${在诸}~{时}${在}~{等时}${在}~{们时}${在}~{些时}${于诸}~{状态}${于}~{等状态}${于}~{们状态}${于}~{些状态}${于诸}~{时}${于}~{等时}${于}~{们时}${于}~{些时}${于诸}~{状态}${于}~{等状态}${于}~{们状态}${于}~{些状态}",
	},
	{
		id: ".nt.$.pl.$.loc.",
		value:
			"{在诸}~${在}~{等}${在}~{们}${在}~{些}${在诸}~{上}${在}~{等上}${在}~{们上}${在}~{些上}${在诸}~{里}${在}~{等里}${在}~{们里}${在}~{些里}${在诸}~{旁}${在}~{等旁}${在}~{们旁}${在}~{些旁}${于诸}~{处}${于}~{等处}${于}~{们处}${于}~{些处}${在诸}~{状态}${在}~{等状态}${在}~{们状态}${在}~{些状态}${处于诸}~{状态}${处于}~{等状态}${处于}~{们状态}${处于}~{些状态}${于诸}~{情形下}${于}~{等情形下}${于}~{们情形下}${于}~{些情形下}${处于诸}~${处于}~{等}${处于}~{们}${处于}~{些}${于诸}~${于}~{等}${于}~{们}${于}~{些}${诸}~{处}$~{等处}$~{们处}$~{些处}${诸}~{时}$~{等时}$~{们时}$~{些时}${诸}~{状态}$~{等状态}$~{们状态}$~{些状态}${在诸}~{情形下}${在}~{等情形下}${在}~{们情形下}${在}~{些情形下}${处于诸}~{情形下}${处于}~{等情形下}${处于}~{们情形下}${处于}~{些情形下}${诸}~{情形下}$~{等情形下}$~{们情形下}$~{些情形下}${在诸}~{处}${在}~{等处}${在}~{们处}${在}~{些处}${在诸}~${在}~{等}${在}~{们}${在}~{些}${在诸}~{处}${在}~{等处}${在}~{们处}${在}~{些处}${在诸}~{时}${在}~{等时}${在}~{们时}${在}~{些时}${于诸}~{状态}${于}~{等状态}${于}~{们状态}${于}~{些状态}${于诸}~{时}${于}~{等时}${于}~{们时}${于}~{些时}${于诸}~{状态}${于}~{等状态}${于}~{们状态}${于}~{些状态}",
	},
	{
		id: ".f.$.pl.$.loc.",
		value:
			"{在诸}~${在}~{等}${在}~{们}${在}~{些}${在诸}~{上}${在}~{等上}${在}~{们上}${在}~{些上}${在诸}~{里}${在}~{等里}${在}~{们里}${在}~{些里}${在诸}~{旁}${在}~{等旁}${在}~{们旁}${在}~{些旁}${于诸}~{处}${于}~{等处}${于}~{们处}${于}~{些处}${在诸}~{状态}${在}~{等状态}${在}~{们状态}${在}~{些状态}${处于诸}~{状态}${处于}~{等状态}${处于}~{们状态}${处于}~{些状态}${于诸}~{情形下}${于}~{等情形下}${于}~{们情形下}${于}~{些情形下}${处于诸}~${处于}~{等}${处于}~{们}${处于}~{些}${于诸}~${于}~{等}${于}~{们}${于}~{些}${诸}~{处}$~{等处}$~{们处}$~{些处}${诸}~{时}$~{等时}$~{们时}$~{些时}${诸}~{状态}$~{等状态}$~{们状态}$~{些状态}${在诸}~{情形下}${在}~{等情形下}${在}~{们情形下}${在}~{些情形下}${处于诸}~{情形下}${处于}~{等情形下}${处于}~{们情形下}${处于}~{些情形下}${诸}~{情形下}$~{等情形下}$~{们情形下}$~{些情形下}${在诸}~{处}${在}~{等处}${在}~{们处}${在}~{些处}${在诸}~${在}~{等}${在}~{们}${在}~{些}${在诸}~{处}${在}~{等处}${在}~{们处}${在}~{些处}${在诸}~{时}${在}~{等时}${在}~{们时}${在}~{些时}${于诸}~{状态}${于}~{等状态}${于}~{们状态}${于}~{些状态}${于诸}~{时}${于}~{等时}${于}~{们时}${于}~{些时}${于诸}~{状态}${于}~{等状态}${于}~{们状态}${于}~{些状态}",
	},
	{ id: ".pl.$.nom.", value: "{诸}~$~{等}$~{们}$~{些}" },
	{ id: "$.pl.$.nom.", value: "{诸}~$~{等}$~{们}$~{些}" },
	{ id: ".1p.$.pl.$.nom.", value: "{诸}~$~{等}$~{们}$~{些}" },
	{ id: ".2p.$.pl.$.nom.", value: "{诸}~$~{等}$~{们}$~{些}" },
	{ id: ".m.$.pl.$.nom.", value: "{诸}~$~{等}$~{们}$~{些}" },
	{ id: ".nt.$.pl.$.nom.", value: "{诸}~$~{等}$~{们}$~{些}" },
	{ id: ".f.$.pl.$.nom.", value: "{诸}~$~{等}$~{们}$~{些}" },
	{ id: ".pl.$.voc.", value: "{诸}~{！}$~{等！}$~{们！}$~{些！}${诸}~{啊}$~{等啊}$~{们啊}$~{些啊}" },
	{ id: "$.pl.$.voc.", value: "{诸}~{！}$~{等！}$~{们！}$~{些！}${诸}~{啊}$~{等啊}$~{们啊}$~{些啊}" },
	{ id: ".1p.$.pl.$.voc.", value: "{诸}~{！}$~{等！}$~{们！}$~{些！}${诸}~{啊}$~{等啊}$~{们啊}$~{些啊}" },
	{ id: ".2p.$.pl.$.voc.", value: "{诸}~{！}$~{等！}$~{们！}$~{些！}${诸}~{啊}$~{等啊}$~{们啊}$~{些啊}" },
	{ id: ".m.$.pl.$.voc.", value: "{诸}~{！}$~{等！}$~{们！}$~{些！}${诸}~{啊}$~{等啊}$~{们啊}$~{些啊}" },
	{ id: ".nt.$.pl.$.voc.", value: "{诸}~{！}$~{等！}$~{们！}$~{些！}${诸}~{啊}$~{等啊}$~{们啊}$~{些啊}" },
	{ id: ".f.$.pl.$.voc.", value: "{诸}~{！}$~{等！}$~{们！}$~{些！}${诸}~{啊}$~{等啊}$~{们啊}$~{些啊}" },
	{ id: ".sg.$.abl.", value: "{由}~${出于}~${从}~{而来}${从}~${来自}~${比}~${由于}~${因为}~" },
	{ id: "$.sg.$.abl.", value: "{由}~${出于}~${从}~{而来}${从}~${来自}~${比}~${由于}~${因为}~" },
	{ id: ".1p.$.sg.$.abl.", value: "{由}~${出于}~${从}~{而来}${从}~${来自}~${比}~${由于}~${因为}~" },
	{ id: ".2p.$.sg.$.abl.", value: "{由}~${出于}~${从}~{而来}${从}~${来自}~${比}~${由于}~${因为}~" },
	{ id: ".m.$.sg.$.abl.", value: "{由}~${出于}~${从}~{而来}${从}~${来自}~${比}~${由于}~${因为}~" },
	{ id: ".nt.$.sg.$.abl.", value: "{由}~${出于}~${从}~{而来}${从}~${来自}~${比}~${由于}~${因为}~" },
	{ id: ".f.$.sg.$.abl.", value: "{由}~${出于}~${从}~{而来}${从}~${来自}~${比}~${由于}~${因为}~" },
	{ id: ".sg.$.acc.", value: "{把}~$~" },
	{ id: "$.sg.$.acc.", value: "{把}~$~" },
	{ id: ".1p.$.sg.$.acc.", value: "{把}~$~" },
	{ id: ".2p.$.sg.$.acc.", value: "{把}~$~" },
	{ id: ".m.$.sg.$.acc.", value: "{把}~$~" },
	{ id: ".nt.$.sg.$.acc.", value: "{把}~$~" },
	{ id: ".f.$.sg.$.acc.", value: "{把}~$~" },
	{ id: ".sg.$.dat.", value: "{对于}~${对}~{来说}${为了}~${向}~${对}~" },
	{ id: "$.sg.$.dat.", value: "{对于}~${对}~{来说}${为了}~${向}~${对}~" },
	{ id: ".1p.$.sg.$.dat.", value: "{对于}~${对}~{来说}${为了}~${向}~${对}~" },
	{ id: ".2p.$.sg.$.dat.", value: "{对于}~${对}~{来说}${为了}~${向}~${对}~" },
	{ id: ".m.$.sg.$.dat.", value: "{对于}~${对}~{来说}${为了}~${向}~${对}~" },
	{ id: ".nt.$.sg.$.dat.", value: "{对于}~${对}~{来说}${为了}~${向}~${对}~" },
	{ id: ".f.$.sg.$.dat.", value: "{对于}~${对}~{来说}${为了}~${向}~${对}~" },
	{ id: ".sg.$.gen.", value: "~{的}$~{之}" },
	{ id: "$.sg.$.gen.", value: "~{的}$~{之}" },
	{ id: ".1p.$.sg.$.gen.", value: "~{的}$~{之}" },
	{ id: ".2p.$.sg.$.gen.", value: "~{的}$~{之}" },
	{ id: ".m.$.sg.$.gen.", value: "~{的}$~{之}" },
	{ id: ".nt.$.sg.$.gen.", value: "~{的}$~{之}" },
	{ id: ".f.$.sg.$.gen.", value: "~{的}$~{之}" },
	{ id: ".sg.$.inst.", value: "{以}~${通过}~${被}~${根据}~${跟}~${经过}~${经由}~${由经}~" },
	{ id: "$.sg.$.inst.", value: "{以}~${通过}~${被}~${根据}~${跟}~${经过}~${经由}~${由经}~" },
	{ id: ".1p.$.sg.$.inst.", value: "{以}~${通过}~${被}~${根据}~${跟}~${经过}~${经由}~${由经}~" },
	{ id: ".2p.$.sg.$.inst.", value: "{以}~${通过}~${被}~${根据}~${跟}~${经过}~${经由}~${由经}~" },
	{ id: ".m.$.sg.$.inst.", value: "{以}~${通过}~${被}~${根据}~${跟}~${经过}~${经由}~${由经}~" },
	{ id: ".nt.$.sg.$.inst.", value: "{以}~${通过}~${被}~${根据}~${跟}~${经过}~${经由}~${由经}~" },
	{ id: ".f.$.sg.$.inst.", value: "{以}~${通过}~${被}~${根据}~${跟}~${经过}~${经由}~${由经}~" },
	{
		id: ".sg.$.loc.",
		value:
			"{在}~${在}~{上}${在}~{里}${在}~{旁}${于}~{处}${在}~{状态}${处于}~{状态}${于}~{情形下}${处于}~${于}~$~{处}$~{时}$~{状态}${在}~{情形下}${处于}~{情形下}$~{情形下}${在}~{处}${在}~${在}~{处}${在}~{时}${于}~{状态}${于}~{时}${于}~{状态}",
	},
	{
		id: "$.sg.$.loc.",
		value:
			"{在}~${在}~{上}${在}~{里}${在}~{旁}${于}~{处}${在}~{状态}${处于}~{状态}${于}~{情形下}${处于}~${于}~$~{处}$~{时}$~{状态}${在}~{情形下}${处于}~{情形下}$~{情形下}${在}~{处}${在}~${在}~{处}${在}~{时}${于}~{状态}${于}~{时}${于}~{状态}",
	},
	{
		id: ".1p.$.sg.$.loc.",
		value:
			"{在}~${在}~{上}${在}~{里}${在}~{旁}${于}~{处}${在}~{状态}${处于}~{状态}${于}~{情形下}${处于}~${于}~$~{处}$~{时}$~{状态}${在}~{情形下}${处于}~{情形下}$~{情形下}${在}~{处}${在}~${在}~{处}${在}~{时}${于}~{状态}${于}~{时}${于}~{状态}",
	},
	{
		id: ".2p.$.sg.$.loc.",
		value:
			"{在}~${在}~{上}${在}~{里}${在}~{旁}${于}~{处}${在}~{状态}${处于}~{状态}${于}~{情形下}${处于}~${于}~$~{处}$~{时}$~{状态}${在}~{情形下}${处于}~{情形下}$~{情形下}${在}~{处}${在}~${在}~{处}${在}~{时}${于}~{状态}${于}~{时}${于}~{状态}",
	},
	{
		id: ".m.$.sg.$.loc.",
		value:
			"{在}~${在}~{上}${在}~{里}${在}~{旁}${于}~{处}${在}~{状态}${处于}~{状态}${于}~{情形下}${处于}~${于}~$~{处}$~{时}$~{状态}${在}~{情形下}${处于}~{情形下}$~{情形下}${在}~{处}${在}~${在}~{处}${在}~{时}${于}~{状态}${于}~{时}${于}~{状态}",
	},
	{
		id: ".nt.$.sg.$.loc.",
		value:
			"{在}~${在}~{上}${在}~{里}${在}~{旁}${于}~{处}${在}~{状态}${处于}~{状态}${于}~{情形下}${处于}~${于}~$~{处}$~{时}$~{状态}${在}~{情形下}${处于}~{情形下}$~{情形下}${在}~{处}${在}~${在}~{处}${在}~{时}${于}~{状态}${于}~{时}${于}~{状态}",
	},
	{
		id: ".f.$.sg.$.loc.",
		value:
			"{在}~${在}~{上}${在}~{里}${在}~{旁}${于}~{处}${在}~{状态}${处于}~{状态}${于}~{情形下}${处于}~${于}~$~{处}$~{时}$~{状态}${在}~{情形下}${处于}~{情形下}$~{情形下}${在}~{处}${在}~${在}~{处}${在}~{时}${于}~{状态}${于}~{时}${于}~{状态}",
	},
	{ id: ".sg.$.nom.", value: "~" },
	{ id: "$.sg.$.nom.", value: "~" },
	{ id: ".1p.$.sg.$.nom.", value: "~" },
	{ id: ".2p.$.sg.$.nom.", value: "~" },
	{ id: ".m.$.sg.$.nom.", value: "~" },
	{ id: ".nt.$.sg.$.nom.", value: "~" },
	{ id: ".f.$.sg.$.nom.", value: "~" },
	{ id: ".sg.$.voc.", value: "~{！}$~{啊}" },
	{ id: "$.sg.$.voc.", value: "~{！}$~{啊}" },
	{ id: ".1p.$.sg.$.voc.", value: "~{！}$~{啊}" },
	{ id: ".2p.$.sg.$.voc.", value: "~{！}$~{啊}" },
	{ id: ".m.$.sg.$.voc.", value: "~{！}$~{啊}" },
	{ id: ".nt.$.sg.$.voc.", value: "~{！}$~{啊}" },
	{ id: ".f.$.sg.$.voc.", value: "~{！}$~{啊}" },

	{ id: ".nom.", value: "~" },
	{ id: ".voc.", value: "~" },
	{ id: ".acc.", value: "~" },
	{ id: ".gen.", value: "~{的}" },
	{ id: ".dat.", value: "{对}~" },
	{ id: ".inst.", value: "{以}~" },
	{ id: ".abl.", value: "{由}~" },
	{ id: ".loc.", value: "{在}~" },
	{ id: ".imp.", value: "{令}~" },
	{ id: ".cond.", value: "{若}" },
	{ id: ".opt.", value: "{愿}~" },
	{ id: ".pres.", value: "~" },
	{ id: ".aor.", value: "{曾}~" },
	{ id: ".pf.", value: "{已}~" },
	{ id: ".fut.", value: "{将}~" },

	{ id: ".prp.", value: "{正}~{的}${正在}~{的}$~{中的}${正}~${正在}~$~{中}" },
	{ id: ".prpa.", value: "{正}~{的}" },
	{ id: ".prpp.", value: "{正被}~{的}" },
	{ id: ".pp.", value: "{已}~{的}$~{完的}${已}~$~{完}" },
	{ id: ".ppa.", value: "{已}~{的}" },
	{ id: ".ppp.", value: "{已被}~{的}" },
	{ id: ".futp.", value: "{将}~{的}" },
	{ id: ".fpa.", value: "{应}~{的}" },
	{ id: ".fpp.", value: "{应被}~{的}${可被}~{的}${能被}~{的}${应被}~${可被}~${能被}~" },
	{ id: ".grd.", value: "{应被}~{的}${可被}~{的}${能被}~{的}${应被}~${可被}~${能被}~" },
	{ id: ".pass.", value: "{被}~" },
	{ id: ".caus.", value: "{使}~" },
	{ id: ".desid.", value: "{要}~" },
	{ id: ".intens.", value: "{执意}~" },
	{ id: ".ger.", value: "~{完之后}$~{了之后}$~{后}$~{完了之后}" },
	{ id: ".abs.", value: "~{完之后}$~{了之后}$~{后}$~{完了之后}" },
	{ id: ".inf.", value: "{用来}~${为了}~${来}~" },

	{ id: ".1p.$.sg.$.pass.", value: "{我被}~" },
	{ id: ".2p.$.sg.$.pass.", value: "{你被}~${汝被}~" },
	{ id: ".3p.$.sg.$.pass.", value: "{其被}~${他被}~${她被}~${它被}~" },
	{ id: ".1p.$.pl.$.pass.", value: "{我们被}~" },
	{ id: ".2p.$.pl.$.pass.", value: "{你们被}~${汝等被}~" },
	{ id: ".3p.$.pl.$.pass.", value: "{其等被}~${他们被}~${她们被}~${它们被}~" },
	{ id: ".1p.$.sg.$.pass.", value: "{我被}~" },
	{ id: ".2p.$.sg.$.pass.", value: "{你被}~" },
	{ id: ".3p.$.sg.$.pass.", value: "{其被}~" },
	{ id: ".1p.$.pl.$.pass.", value: "{我们被}~" },
	{ id: ".2p.$.pl.$.pass.", value: "{你们被}~" },
	{ id: ".3p.$.pl.$.pass.", value: "{其等被}~" },

	{ id: ".1p.$.sg.$.caus.", value: "{我令}~" },
	{ id: ".2p.$.sg.$.caus.", value: "{你令}~" },
	{ id: ".3p.$.sg.$.caus.", value: "{其令}~" },
	{ id: ".1p.$.pl.$.caus.", value: "{我们令}~" },
	{ id: ".2p.$.pl.$.caus.", value: "{你们令}~" },
	{ id: ".3p.$.pl.$.caus.", value: "{其等令}~" },
	{ id: ".1p.$.sg.$.caus.", value: "{我令}~" },
	{ id: ".2p.$.sg.$.caus.", value: "{你令}~" },
	{ id: ".3p.$.sg.$.caus.", value: "{其令}~" },
	{ id: ".1p.$.pl.$.caus.", value: "{我们令}~" },
	{ id: ".2p.$.pl.$.caus.", value: "{你们令}~" },
	{ id: ".3p.$.pl.$.caus.", value: "{其等令}~" },

	{ id: ".1p.$.sg.$.caus.opt.", value: "{我应令}~" },
	{ id: ".2p.$.sg.$.caus.opt.", value: "{你应令}~" },
	{ id: ".3p.$.sg.$.caus.opt.", value: "{其应令}~" },
	{ id: ".1p.$.pl.$.caus.opt.", value: "{我们应令}~" },
	{ id: ".2p.$.pl.$.caus.opt.", value: "{你们应令}~" },
	{ id: ".3p.$.pl.$.caus.opt.", value: "{其等应令}~" },
	{ id: ".1p.$.sg.$.caus.opt.", value: "{我应令}~" },
	{ id: ".2p.$.sg.$.caus.opt.", value: "{你应令}~" },
	{ id: ".3p.$.sg.$.caus.opt.", value: "{其应令}~" },
	{ id: ".1p.$.pl.$.caus.opt.", value: "{我们应令}~" },
	{ id: ".2p.$.pl.$.caus.opt.", value: "{你们应令}~" },
	{ id: ".3p.$.pl.$.caus.opt.", value: "{其等应令}~" },

	{ id: ".1p.$.sg.$.caus.pass.", value: "{我被令}~" },
	{ id: ".2p.$.sg.$.caus.pass.", value: "{你被令}~" },
	{ id: ".3p.$.sg.$.caus.pass.", value: "{其被令}~" },
	{ id: ".1p.$.pl.$.caus.pass.", value: "{我们被令}~" },
	{ id: ".2p.$.pl.$.caus.pass.", value: "{你们被令}~" },
	{ id: ".3p.$.pl.$.caus.pass.", value: "{其等被令}~" },
	{ id: ".1p.$.sg.$.caus.pass.", value: "{我被令}~" },
	{ id: ".2p.$.sg.$.caus.pass.", value: "{你被令}~" },
	{ id: ".3p.$.sg.$.caus.pass.", value: "{其被令}~" },
	{ id: ".1p.$.pl.$.caus.pass.", value: "{我们被令}~" },
	{ id: ".2p.$.pl.$.caus.pass.", value: "{你们被令}~" },
	{ id: ".3p.$.pl.$.caus.pass.", value: "{其等被令}~" },

	{ id: ".1p.$.sg.$.caus.doub.", value: "{派我令}~" },
	{ id: ".2p.$.sg.$.caus.doub.", value: "{派你令}~" },
	{ id: ".3p.$.sg.$.caus.doub.", value: "{派其令}~" },
	{ id: ".1p.$.pl.$.caus.doub.", value: "{派我们令}~" },
	{ id: ".2p.$.pl.$.caus.doub.", value: "{派你们令}~" },
	{ id: ".3p.$.pl.$.caus.doub.", value: "{派其等令}~" },
	{ id: ".1p.$.sg.$.caus.doub.", value: "{派我令}~" },
	{ id: ".2p.$.sg.$.caus.doub.", value: "{派你令}~" },
	{ id: ".3p.$.sg.$.caus.doub.", value: "{派其令}~" },
	{ id: ".1p.$.pl.$.caus.doub.", value: "{派我们令}~" },
	{ id: ".2p.$.pl.$.caus.doub.", value: "{派你们令}~" },
	{ id: ".3p.$.pl.$.caus.doub.", value: "{派其等令}~" },
];

var local_parent_formula = [
	{ id: ".imp.", value: "~" },
	{ id: ".cond.", value: "~" },
	{ id: ".opt.", value: "~" },
	{ id: ".pres.", value: "~" },
	{ id: ".aor.", value: "~" },
	{ id: ".pf.", value: "已~完" },
	{ id: ".fut.", value: "~" },
	{ id: ".prp.", value: "正~的" },
	{ id: ".prpa.", value: "正~的" },
	{ id: ".prpp.", value: "正被~的" },
	{ id: ".pp.", value: "已~的" },
	{ id: ".ppa.", value: "已~的" },
	{ id: ".ppp.", value: "已被~的" },
	{ id: ".futp.", value: "将~的" },
	{ id: ".fpa.", value: "将~的" },
	{ id: ".fpp.", value: "应被~的" },
	{ id: ".grd.", value: "应被~的" },
	{ id: ".pass.", value: "被~" },
	{ id: ".caus.", value: "使~" },
	{ id: ".desid.", value: "要~" },
	{ id: ".intens.", value: "执意~" },
	{ id: ".ger.", value: "~" },
	{ id: ".abs.", value: "~" },
	{ id: ".inf.", value: "~" },
];
var local_gui = {
	applyto: "应用到：",
	heading: "标题",
	wbw: "逐词解析",
	translate: "译文",
	note: "注释",
	current: "当前",
	up: "向上",
	down: "向下",
	thischapter: "本章",
	all: "全部",
	lock: "锁定",
	toDB: "上传至用户数据库",
	cancel: "取消",
	para: "段",
	translate1: "译",
	read: "阅读",
	edit: "编辑",
	newheading: "内容编辑",
	newword: "新增词汇",
	wordtype: "单词类型",
	gramma: "语法信息",
	parent: "直系源型",
	part: "拆分方式",
	partmeaning: "拆分含义",
	meaning: "整体含义",
	userdict: "用户词典",
	dictsouce: "词典来源",
	otherdict: "其他词典",
	children: "直系派生",
	newproject: "启动新工程",
	nofilename: "文件名缺失",
	loading: "载入中……",
	ok: "成功",
	removeword: "黏音词组分已移除",
	unsplit: "黏音词拆分",
	allsplit: "黏音词已成功拆分 ^-^",
	modifyok: "已批量修改",
	success: "词",
	level: "层级",
	totally: "共计：",
	translate2: "翻译：",
	edit1: "编辑：",
	revision: "校对：",
	edition: "版本：",
	language: "语言：",
	innerdict: "内联字典",
	dict_match: "匹配字典数据到文档",
	match_end: "文档更新结束，完成度",
	empty1: "清空",
	wordmap: "词源树",
	auto: "自动",
	new: "新建",
	factors_input: "点此输入拆分",
	meaning_input: "点此输入词意",
	parent_input: "点此输入父级",
	read_only: "只读",
	sent_trans: "整句译文",
	more: "更多",
	statistical_data: "统计数据",
	wordnum: "文字总量：",
	vocabulary: "词汇总量：",
	words: "词",
	letters: "字母",
	word_length: "单词均长",
	num_k: "千",
	num_m: "兆",
	repeat: "重复系数：",
	tran_workload: "全文翻译：",
	workload: "工程评估",
	total_workload: "工作总量",
	product: "译文字数",
	difficulty: "难度评级",
	min: "分钟",
	h: "小时",
	week: "周",
	year: "年",
	round_1: "第",
	round_2: "轮",
	done: "检索完毕",
	all_done: "查询完成",
	checking: "检索中",
	auto_fill: "自动填充",
	finished: "已完成",
	now_time: "现在",
	twilight_time: "曙光",
	noon_time: "正午",
	vikala: "不适当的时间",
	kala: "适当的时间",
	gama_entry: "入村",
	need_inform: "未告知其他比库",
	no_string: "不能",
	yes_string: "可以",
	eat: "进餐",
	CE: "公元",
	BE: "佛历",
	year_1: "年",
	month_1: "月",
	months: "个月又",
	days: "天",
	years: "年",
	day: "日",
	//"day_1":"日" ,
	today: "今日",
	dhamma_time: "会延续五千年的教法",
	past: "已過去",
	left: "還剩下",
	year_0: "年",
	season: "季节",
	month: "月",
	pakkha: "月相变化",
	date: "日期",
	week_day: "星期",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",
	"": "",

	The_End: "这是最后一行，请不要修改",
};
var local_dictname = [
	{ id: "bh", value: "巴汉-明法尊者" },
	{ id: "sy", value: "巴日-汉译" },
	{ id: "user", value: "用户词典" },
	{ id: "co", value: "Concise" },
	{ id: "unkow", value: "未知" },
	{ id: "vn", value: "不规则表-V" },
	{ id: "SCR", value: "词根表-中" },
	{ id: "ENR", value: "词根表-EN" },
	{ id: "parts", value: "零件库" },
	{ id: "sys_ir", value: "不规则表-K" },
	{ id: "PM", value: "巴緬" },
	{ id: "", value: "" },
	{ id: "", value: "" },
	{ id: "", value: "" },
	{ id: "", value: "" },
];
var local_language = [
	{ id: "en", value: "英语" },
	{ id: "zh", value: "简体中文" },

	{ id: ".end.", value: "—" },
];

var local_language_str = [{ id: " ", value: "" }];
